package deepintojava.javaFoundation.JavaBasic.stirngTest;

/**
 * @author fanyuzhuo
 * @createAt 2021-08-01 10:01
 * @description
 */
public class FinalString {
    public static void main(String[] args) {
        String a = "Hello world";
        String b = a.replace("o", "x");
        System.out.println(a);
        System.out.println(b);

        String wholeString = "3.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，十月革命一声炮响，给中国送来了马克思列宁主义。在中国人民和中华民族的伟大觉醒中，在马克思列宁主义同中国__A__的紧密结合中，中国共产党应运而生。\n" +
                "A、工人运动\n" +
                "B、新文化运动\n" +
                "4.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，中国共产党一经诞生，就把为中国人民谋幸福、为中华民族谋复兴确立为自己的初心使命。一百年来，中国共产党团结带领中国人民进行的一切奋斗、一切牺牲、一切创造，归结起来就是一个主题：___B____。\n" +
                "A、全面建成社会主义现代化强国\n" +
                "B、实现中华民族伟大复兴\n" +
                "5.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，新民主主义革命的胜利，彻底结束了旧中国____A___的历史。\n" +
                "A、半殖民地半封建社会\n" +
                "B、封建社会\n" +
                "6.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，新民主主义革命的胜利，为实现中华民族伟大复兴创造了____A___社会条件。\n" +
                "A、根本\n" +
                "B、必要\n" +
                "7.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，我们实现了人民生活从温饱不足到____ ____、奔向____ ___的历史性跨越，为实现中华民族伟大复兴提供了充满新的活力的体制保证和快速发展的物质条件。AB\n" +
                "A、总体小康\n" +
                "B、全面小康\n" +
                "C、消除绝对贫困\n" +
                "D、全面小康\n" +
                "8.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，党的十八大以来，中国特色社会主义进入新时代，我们坚持和加强党的全面领导，统筹推进“五位一体”___ _____、协调推进“四个全面”_______，坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化，坚持依规治党、形成比较完善的党内法规体系，战胜一系列重大风险挑战，实现第一个百年奋斗目标，明确实现第二个百年奋斗目标的战略安排。AB\n" +
                "A、总体布局\n" +
                "B、战略布局\n" +
                "C、战略布局\n" +
                "D、总体布局\n" +
                "9.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，一百年来，中国共产党团结带领中国人民，以___A___的大无畏气概，书写了中华民族几千年历史上最恢宏的史诗。\n" +
                "A“为有牺牲多壮志，敢教日月换新天”\n" +
                "B“世上无难事，只要肯登攀”\n" +
                "10.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，一百年前，中国共产党的先驱们创建了中国共产党，形成了坚持真理、_______，践行初心、\n" +
                "担当使命，不怕牺牲、_____，对党忠诚、不负人民的伟大建党精神，这是中国共产党的精神之源。CD\n" +
                "A、坚定信念\n" +
                "B、百折不挠\n" +
                "C、坚守理想\n" +
                "D、英勇斗争\n" +
                "11.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，____A____\n" +
                "是中国特色社会主义最本质的特征，是中国特色社会主义制度的最大优势，是党和国家的根本所在、命脉所在，是全国各族人民的利益所系、命运所系。\n" +
                "A、中国共产党领导\n" +
                "B、坚持马克思主义基本原理\n" +
                "12.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们必须坚持党的全面领导，不断完善党的领导，增强“四个意识”、坚定“四个自信”、做到“两个维护”，___A___，不断提高党科学执政、民主执政、依法执政水平，充分发挥党总揽全局、协调各方的领导核心作用！\n" +
                "A、牢记“国之大者”\n" +
                "B、胸怀“两个大局”\n" +
                "13.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们必须紧紧依靠人民创造历史，坚持_______，站稳人民立场，贯彻党的群众路线，尊重人民首创精神，践行以人民为中心的发展思想，发展______人民民主，维护社会公平正义，着力解决发展不平衡不充分问题和人民群众急难愁盼问题，推动人的全面发展、全体人民共同富裕取得更为明显的实质性进展！AB\n" +
                "A、全心全意为人民服务的根本宗旨\n" +
                "B全过程\n" +
                "C、密切联系群众的最大政治优势\n" +
                "D 全方位\n" +
                "14.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，____A____\n" +
                "是我们立党立国的根本指导思想，是我们党的灵魂和旗帜。\n" +
                "A、马克思主义\n" +
                "B、社会主义道路\n" +
                "15.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，中国共产党坚持马克思主义基本原理，坚持实事求是，从中国实际出发，洞察时代大势，把握历史主动，进行艰辛探索，不断推进马克思主义______、______指导中国人民不断推进伟大社会革命。AB\n" +
                "A、中国化\n" +
                "B时代化\n" +
                "C、大众化\n" +
                "16.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们必须坚持把马克思主义基本原理同中国具体实际相结合、同____B____相结合。\n" +
                "A、中国历史\n" +
                "B、中华优秀传统文化\n" +
                "17.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，以史为鉴、开创未来，必须坚持和发展中国特色社会主义。____A____，是党的全部理论和实践立足点，更是党百年奋斗得出的历史结论。\n" +
                "A、走自己的路\n" +
                "B、一切从实际出发\n" +
                "18.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，强国必须强军，军强才能国安。坚持____A____、建设自己的人民军队，是党在血与火的斗争中得出的颠扑不破的真理。\n" +
                "A、党指挥枪\n" +
                "B、政治建军\n" +
                "19.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们必须高举和平、发展、合作、共赢旗帜，奉行____A____的和平外交政策，坚持走和平发展道路，推动建设新型国际关系，推动构建人类命运共同体，推动共建“一带一路”高质量发展，以中国的新发展为世界提供新机遇。\n" +
                "A、独立自主\n" +
                "B、平等互利\n" +
                "20.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，中国共产党将继续同一切爱好和平的国家和人民一道，弘扬和平、发展、公平、正义、民主、自由的全人类共同价值，坚持合作、不搞对抗，坚持开放、不搞封闭，坚持互利共赢、不搞_____B____，反对霸权主义和强权政治，推动历史车轮向着光明的目标前进！\n" +
                "A“新冷战”\n" +
                "B、零和博弈\n" +
                "21.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们必须增强____A____、始终居安思危，贯彻总体国家安全观。\n" +
                "A、忧患意识\n" +
                "B、风险意识\n" +
                "22.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，___B_____是中国共产党团结海内外全体中华儿女实现中华民族伟大复兴的重要法宝。\n" +
                "A、中国共产党领导的多党合作和政治协商制度\n" +
                "B、爱国统一战线\n" +
                "23.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，勇于____B____是中国共产党区别于其他政党的显著标志。\n" +
                "A、自我批评\n" +
                "B、自我革命\n" +
                "24.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新的征程上，我们要牢记打铁必须自身硬的道理，增强____A___永远在路上的政治自觉，以党的政治建设为统领，继续推进新时代党的建设新的伟大工程。\n" +
                "A、全面从严治党\n" +
                "B、作风建设\n" +
                "25.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，我们要全面准确贯彻“一国两制”、“港人治港”、“澳人治澳”、高度自治的方针，落实中央对香港、澳门特别行政区全面____A____。\n" +
                "A、管治权\n" +
                "B、主导权\n" +
                "26.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，解决台湾问题、实现祖国完全统一，是中国共产党矢志不渝的历史任务，是全体中华儿女的共同愿望。任何人都不要低估中国人民捍卫___A____的坚强决心、坚定意志、强大能力！\n" +
                "A、国家主权和领土完整\n" +
                "B、国家主权、安全、发展利益\n" +
                "27.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上强调，新时代的中国青年要以实现中华民族伟大复兴为己任，增强做中国人的志气、骨气、___B__，不负时代，不负韶华，不负党和人民的殷切期望！\n" +
                "A、锐气\n" +
                "B、底气\n" +
                "28.2021年7月1日，庆祝中国共产党成立100周年大会隆重举行。习近平代表党中央号召全体中国共产党员，牢记__A___，坚定___A___，践行___A___，永远保持同人民群众的血肉联系，始终同人民想在一起、干在一起，风雨同舟、同甘共苦，继续为实现人民对美好生活的向往不懈努力，努力为党和人民争取更大光荣！\n" +
                "A、初心使命、理想信念、党的宗旨\n" +
                "B、党的宗旨、理想信念、初心使命\n" +
                "29.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，一百年来，中国共产党团结带领中国人民，以“为有牺牲多壮志，敢教日月换新天”的大无畏气概，书写了中华民族几千年历史上最恢宏的史诗。这一百年来开辟的____A___、创造的___A____、取得的____A___，必将载入中华民族发展史册、人类文明发展史册。\n" +
                "A、伟大道路、伟大事业、伟大成就\n" +
                "B、社会主义、道路成功经验、辉煌成就\n" +
                "30.2021年7月1日，习近平在庆祝中国共产党成立100周年大会上指出，中国共产党关注人类前途命运，同世界上一切进步力量携手前进，中国始终是世界和平的___B___、全球发展的___B__、国际秩序的___B___!\n" +
                "A、维护者、践行者、捍卫者\n" +
                "B、建设者、贡献者、维护者\n" +
                "31、一百年前，中国共产党成立时只有________多名党员，今天已经成为拥有________多万名党员、领导着14亿多人口大国、具有重大全球影响力的世界第一大执政党。C\n" +
                "A、20，9100\n" +
                "B、30，9200\n" +
                "C、50，9500\n" +
                "D、70，9800\n" +
                "32.我们坚持和加强党的全面领导，统筹推进________、协调推进________，坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化 A\n" +
                "A、“五位一体”总体布局，“四个全面”战略布局\n" +
                "B、“四个全面”总体布局，“五位一体”战略布局\n" +
                "C、“八个明确”总体布局，“十四个坚持”战略布局\n" +
                "D、“十四个坚持”总体布局，“八个明确”战略布局\n" +
                "33.________是我们立党立国的根本指导思想，是我们党的灵魂和旗帜。B\n" +
                "A、实事求是\n" +
                "B、马克思主义\n" +
                "C、群众路线\n" +
                "D、全心全意为人民服务\n" +
                "34.新的征程上，我们必须高举和平、发展、合作、共赢旗帜，奉行独立自主的和平外交政策，坚持走和平发展道路，推动建设新型国际关系，推动构建________，推动共建“________”高质量发展，以中国的新发展为世界提供新机遇。B\n" +
                "A、新发展格局，一带一路\n" +
                "B、人类命运共同体，一带一路\n" +
                "C、新型大国关系，人类命运共同体\n" +
                "D、新发展格局，人类命运共同体\n" +
                "35.________是党和人民历经千辛万苦、付出巨大代价取得的根本成就，是实现中华民族伟大复兴的正确道路。D\n" +
                "A、改革开放\n" +
                "B、全面建成小康社会\n" +
                "C、民族独立和人民解放\n" +
                "D、中国特色社会主义\n" +
                "36.新中国成立以来，我们实现了从生产力相对落后的状况到经济总量跃居世界________的历史性突破。B\n" +
                "A、第一\n" +
                "B、第二\n" +
                "C、第三\n" +
                "D、第四\n" +
                "37.为了实现中华民族伟大复兴，中国共产党团结带领中国人民，自信自强、守正创新，统揽________，创造了新时代中国特色社会主义的伟大成就。D\n" +
                "A、伟大斗争、伟大理论、伟大事业、伟大思想\n" +
                "B、伟大实践、伟大理论、伟大事业、伟大梦想\n" +
                "C、伟大实践、伟大工程、伟大事业、伟大思想\n" +
                "D、伟大斗争、伟大工程、伟大事业、伟大梦想\n" +
                "38.新的征程上，我们必须坚持把马克思主义基本原理同中国具体实际相结合、同________相结合，用马克思主义观察时代、把握时代、引领时代，继续发展当代中国马克思主义、21世纪马克思主义！C\n" +
                "A、社会主义核心价值观\n" +
                "B、伟大复兴中国梦\n" +
                "C、中华优秀传统文化\n" +
                "D、共产主义远大理想\n" +
                "39.________是中华民族5000多年来一直追求和传承的理念，中华民族的血液中没有侵略他人、称王称霸的基因。C\n" +
                "A、人类命运共同体\n" +
                "B、互不干涉内政\n" +
                "C、和平、和睦、和谐\n" +
                "D、独立自主\n" +
                "40.我们必须全面深化改革开放，立足新发展阶段，完整、准确、全面贯彻新发展理念，构建新发展格局，推动________发展。A\n" +
                "A、高质量\n" +
                "B、又好又快\n" +
                "C、绿色\n" +
                "D、创新协调\n" +
                "41.为了拯救民族危亡，中国人民奋起反抗，仁人志士奔走呐喊，太平天国运动、戊戌变法、义和团运动、辛亥革命接连而起，各种救国方案轮番出台，但都以失败而告终。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "42.走自己的路，是党的全部理论和实践立足点，更是党百年奋斗得出的历史结论。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "43.中国共产党一经诞生，就把为中国人民谋幸福、为中华民族谋复兴确立为自己的初心使命。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "44.以人民为中心是中国共产党区别于其他政党的显著标志。B\n" +
                "A、正确\n" +
                "B、错误\n" +
                "45.一百年来，中国共产党弘扬伟大建党精神，在长期奋斗中构建起中国共产党人的精神谱系，锤炼出鲜明的政治品格。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "46.中共产党根基在人民、血脉在人民、力量在人民。中国共产党始终代表最广大人民根本利益，与人民休戚与共、生死相依，没有任何自己的利益，从来不代表任何利益集团、任何权势团体、任何特权阶层的利益。B\n" +
                "A、正确\n" +
                "B、错误\n" +
                "47.新的征程上，我们必须增强忧患意识、始终居安思危，贯彻总体国家安全观，统筹发展和安全，统筹中华民族伟大复兴战略全局和世界多极化发展大变局。B\n" +
                "A、正确\n" +
                "B、错误\n" +
                "48.解决台湾问题、实现祖国完全统一，是中国共产党矢志不渝的历史任务，是全体中华儿女的共同愿望。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "49.今天，我们比历史上任何时期都更接近、更有信心和能力实现中华民族伟大复兴的目标，同时必须准备付出更为艰巨、更为艰苦的努力。A\n" +
                "A、正确\n" +
                "B、错误\n" +
                "50.新的征程上，我们要牢记打铁必须自身硬的道理，增强全面从严治党永远在路上的政治自觉，以党的组织建设为统领，继续推进新时代党的建设新的伟大工程，不断严密党的组织体系，着力建设德才兼备的高素质干部队伍。B\n" +
                "A、正确\n" +
                "B、错误\n";
        String[] split = wholeString.split("\n");
        for (int i = 0; i < split.length; i++) {
//            System.out.println(split[i]);
            if (split[i].startsWith("1")
                    || split[i].startsWith("2")
                    || split[i].startsWith("3")
                    || split[i].startsWith("4")
                    || split[i].startsWith("5")
                    || split[i].startsWith("6")
                    || split[i].startsWith("7")
                    || split[i].startsWith("8")
                    || split[i].startsWith("9")) {
                if (split[i].substring(2).startsWith(".")) {
                    System.out.print(split[i].substring(3) + "\t");
                } else {
                    System.out.print(split[i].substring(2) + "\t");
                }
            }
            if (split[i].startsWith("A")
                    || split[i].startsWith("B")
                    || split[i].startsWith("C")
                    || split[i].startsWith("D")
                    || split[i].startsWith("E")
                    || split[i].startsWith("F")) {
                if (split[i + 1].startsWith("1")
                        || split[i + 1].startsWith("2")
                        || split[i + 1].startsWith("3")
                        || split[i + 1].startsWith("4")
                        || split[i + 1].startsWith("5")
                        || split[i + 1].startsWith("6")
                        || split[i + 1].startsWith("7")
                        || split[i + 1].startsWith("8")
                        || split[i + 1].startsWith("9")) {
                    System.out.print(split[i].substring(2) + "\n");
                } else {
                    System.out.print(split[i].substring(2) + "\t");
                }
            }
        }

    }
}