package deepintojava.sinovatio.zgxx;

/**
 * @author fanyuzhuo
 * @createAt 2021-06-03 09:55
 * @description
 */
public class TikuTest {

    public static void main(String[] args) {
        String questions =
                "标准着中国新民主主义革命开端的历史事件是（   ）\n" +
                "新文化运动\t五四运动\t中国共产党成立\t五卅运动\n" +
                "党的（      ），把邓小平理论确定为党的指导思想。\n" +
                "十三大\t十四大\t十五大\t十六大\n" +
                "1945年，党的（   ）确立了毛泽东思想为全党的指导思想。\n" +
                "六大\t六届六中全会\t七大\t八大\n" +
                "提出“停止使用以阶级斗志为纲的口号”的会议是（     ）\n" +
                "八届九中全会\t中共十一大\t十一届三中全会  D.四届人大一次会议\n" +
                "党员如果没有正当理由，连续（     ）不参加党的组织生活，或不缴纳党费，或不做党所分配的工作，就被认为是自行脱党。\n" +
                "六个月\t一年\n" +
                "一年半\t两年\n" +
                "党中央、国务院正式批准公安部成立侦察技术局（序列为公安部第二十局）的时间？（   ）\n" +
                "1955年11月12日\t1953年10月22日\n" +
                "1956年6月23日\t1955年12月12日\n" +
                "我国人民警察是国家重要的（   ）力量。\n" +
                "行政执法和刑事执法\t治安行政和政治安全\n" +
                "治安行政和刑事司法\t政治保卫和刑事执法\n" +
                "、1930年，毛泽东的著作《反对本本主义》从哲学的高度阐述了（     ）。\n" +
                "党的政治路线\t党的组织路线\t党的作风路线\t党的思想路线\n" +
                "1992年邓小平视察（       ）等地的讲话，通称“南方谈话”。\n" +
                "武昌\t深圳\t珠海\t上海\n" +
                "打造“信息技侦”升级版，应做到坚持（       ）\n" +
                "党管技侦根本原则\t围绕中心、服务大局\n" +
                "改革引领、驱动创新\t系统观念、法治思维、强基导向\n" +
                "违规泄露警务工作秘密和公民个人信息问题专整治重点内容包括：（       ）\n" +
                "违规发放和使用公安网数字证书\t非法买卖公民个人信息\n" +
                "未经批准或非工作原因擅自查询公民个人信息  D.是否开展相关保密教育培训  \n" +
                "防止干预司法“三个规定”指（       ）\n" +
                "领导干部干预司法活动、插手具体案件处理的记录、通报和责任追究规定\n" +
                "司法机关内部人员过问案件的记录和责任追究规定 \n" +
                "关于进一步规范司法人员与当事人、律师、特殊关系人、中介组织接触交往行为的若干规定\n" +
                "公安机关内部人员干预、插手案件办理的记录、通报和责任追究规定\n" +
                "习近平总书记指出“党的领导”主要体现在：（       ）\n" +
                "在党的科学理论和正确路线方针政策上\t在党的执政能力和执政水平上\n" +
                "在党的决策水平和党的公信力上\t在党的严密组织体系和强大组织力上\n" +
                "以下哪些属于公安部明确的“六大顽瘴痼疾”。（      ）\n" +
                "违规经商办企业\t违规酒驾醉驾\t违规参股借贷        \n" +
                "滥用技侦措施\t有案不立、压案不查\t违反防止干预司法“三个规定”";
        System.out.println(questions);
    }
}
